# CoordinateSystem Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConnectorElement..::..CoordinateSystem Property
ConnectorElement Class See Also
---
The coordinate system of the connector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual Transform CoordinateSystem { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property CoordinateSystem As Transform
	Get
```

Visual C++
---
```text
public:
virtual property Transform^ CoordinateSystem {
	Transform^ get ();
}
```

# ### Implements
IConnector..::..CoordinateSystem
# Remarks
The Z axis of the coordinate system is the normal to the plane of the connector.
# See Also
ConnectorElement Class
Autodesk.Revit.DB Namespace